sysbench/results/aws/mysql/alta/parallel/read_1.txt
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            121912
        write:                           0
        other:                           17416
        total:                           139328
    transactions:                        8708   (144.63 per sec.)
    queries:                             139328 (2314.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      144.6327
    time elapsed:                        60.2077s
    total number of events:              8708

Latency (ms):
         min:                                    3.59
         avg:                                  344.84
         max:                                 1142.74
         95th percentile:                      502.20
         sum:                              3002858.51

Threads fairness:
    events (avg/stddev):           174.1600/22.46
    execution time (avg/stddev):   60.0572/0.04